In [1]:
import numpy as np
import pandas as pd

### 处理缺失值

In [2]:
string_data = pd.Series(['abc', 'bcd', np.nan, 'def'])
string_data

0    abc
1    bcd
2    NaN
3    def
dtype: object

In [3]:
string_data.isnull()  # numpy中nan是not a number，pandas中采用R惯例，用na，not available表示缺失值。

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None  # Python 内建的 None 值也会被当作 NA
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### 过滤缺失值

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()

In [9]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned  # 可以设置 how='all'，删除所有值为 NA 的行

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA  # 添加一个全空的列
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')  # 删除列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
# 保留包含一定数量的观察值的行
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.218544       NaN       NaN
1 -0.469242       NaN       NaN
2  0.106351       NaN -0.080885
3  0.147522       NaN -1.113715
4 -1.472238  1.215677 -0.315713
5  1.468351  1.534315 -0.315905
6  2.242189 -1.331932 -1.065451

In [15]:
df.dropna()

          0         1         2
4 -1.472238  1.215677 -0.315713
5  1.468351  1.534315 -0.315905
6  2.242189 -1.331932 -1.065451

In [16]:
df.dropna(thresh=2)

          0         1         2
2  0.106351       NaN -0.080885
3  0.147522       NaN -1.113715
4 -1.472238  1.215677 -0.315713
5  1.468351  1.534315 -0.315905
6  2.242189 -1.331932 -1.065451

#### 补全缺失值

In [17]:
df.fillna(0)

          0         1         2
0 -0.218544  0.000000  0.000000
1 -0.469242  0.000000  0.000000
2  0.106351  0.000000 -0.080885
3  0.147522  0.000000 -1.113715
4 -1.472238  1.215677 -0.315713
5  1.468351  1.534315 -0.315905
6  2.242189 -1.331932 -1.065451

In [18]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.218544  0.500000  0.000000
1 -0.469242  0.500000  0.000000
2  0.106351  0.500000 -0.080885
3  0.147522  0.500000 -1.113715
4 -1.472238  1.215677 -0.315713
5  1.468351  1.534315 -0.315905
6  2.242189 -1.331932 -1.065451

In [19]:
# fillna 默认返回新对象，但也可以原地修改
_ = df.fillna(0, inplace=True)
df, _

(          0         1         2
 0 -0.218544  0.000000  0.000000
 1 -0.469242  0.000000  0.000000
 2  0.106351  0.000000 -0.080885
 3  0.147522  0.000000 -1.113715
 4 -1.472238  1.215677 -0.315713
 5  1.468351  1.534315 -0.315905
 6  2.242189 -1.331932 -1.065451,
 None)

In [20]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.863135  1.712254 -0.233844
1 -1.787906 -0.318367 -0.960555
2 -0.216110       NaN -0.051777
3  0.414601       NaN -0.153475
4 -0.278671       NaN       NaN
5  0.711954       NaN       NaN

In [21]:
# 使用插值方法
df.fillna(method='ffill')

          0         1         2
0 -0.863135  1.712254 -0.233844
1 -1.787906 -0.318367 -0.960555
2 -0.216110 -0.318367 -0.051777
3  0.414601 -0.318367 -0.153475
4 -0.278671 -0.318367 -0.153475
5  0.711954 -0.318367 -0.153475

In [22]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.863135  1.712254 -0.233844
1 -1.787906 -0.318367 -0.960555
2 -0.216110 -0.318367 -0.051777
3  0.414601 -0.318367 -0.153475
4 -0.278671       NaN -0.153475
5  0.711954       NaN -0.153475

In [23]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())  # 使用均值填充缺失值

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 数据转换
#### 删除重复值

In [24]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [26]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [27]:
data['v1'] = range(7)

In [28]:
data.drop_duplicates(subset=['k1'])  # 默认保留第一个观测到的值

    k1  k2  v1
0  one   1   0
1  two   1   1

In [29]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

#### 使用函数或映射进行数据转换

In [30]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [32]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

#### 替代值

In [35]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
data.replace({-999: np.nan, -1000: 0})  # data.str.replace 是对字符串按元素替代的

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

#### 重命名轴索引

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [41]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [42]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
data.rename(index=str.title, columns=str.upper)  # 获得副本

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [44]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [45]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)  # 原地操作
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### 离散化和分箱

In [46]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [47]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [48]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [49]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [50]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [51]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins=bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [52]:
data = np.random.rand(20)
pd.cut(data, bins=4, precision=2)  # 将十进制精度限制在两位

[(0.13, 0.35], (0.13, 0.35], (0.35, 0.56], (0.35, 0.56], (0.78, 0.99], ..., (0.35, 0.56], (0.78, 0.99], (0.56, 0.78], (0.78, 0.99], (0.56, 0.78]]
Length: 20
Categories (4, interval[float64, right]): [(0.13, 0.35] < (0.35, 0.56] < (0.56, 0.78] < (0.78, 0.99]]

In [53]:
data = np.random.randn(1000)  # 正态分布
cats = pd.qcut(data, 4)   # 基于样本分位数分箱
cats

[(-0.0343, 0.672], (-3.46, -0.738], (-0.738, -0.0343], (-0.0343, 0.672], (-3.46, -0.738], ..., (-3.46, -0.738], (-0.0343, 0.672], (-0.738, -0.0343], (0.672, 3.162], (-0.0343, 0.672]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.46, -0.738] < (-0.738, -0.0343] < (-0.0343, 0.672] < (0.672, 3.162]]

In [54]:
pd.value_counts(cats)

(-3.46, -0.738]      250
(-0.738, -0.0343]    250
(-0.0343, 0.672]     250
(0.672, 3.162]       250
dtype: int64

In [55]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])  # 传入自定义分位数

[(-0.0343, 1.291], (-1.33, -0.0343], (-1.33, -0.0343], (-0.0343, 1.291], (-1.33, -0.0343], ..., (-3.46, -1.33], (-0.0343, 1.291], (-1.33, -0.0343], (-0.0343, 1.291], (-0.0343, 1.291]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.46, -1.33] < (-1.33, -0.0343] < (-0.0343, 1.291] < (1.291, 3.162]]

#### 检测和过滤异常值

In [56]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025386    -0.029834     0.020599    -0.015371
std       0.965588     1.007159     1.017420     0.979205
min      -3.746816    -3.224799    -3.015585    -3.010342
25%      -0.673340    -0.716686    -0.654987    -0.718126
50%      -0.025894    -0.069529     0.027448    -0.047663
75%       0.664801     0.646900     0.720121     0.686966
max       2.989419     3.336525     3.014799     3.163508

In [57]:
col = data[2]
col[np.abs(col) > 3]

94     3.008855
441    3.014799
877   -3.015585
Name: 2, dtype: float64

In [58]:
(np.abs(data) > 3).any(0)

0    True
1    True
2    True
3    True
dtype: bool

In [59]:
# 使用 any 方法，选出绝对值大于3的行
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
60   0.663817 -3.025599  0.013330 -1.357378
94   0.472666 -2.079565  3.008855  0.904461
108 -3.746816 -0.968627  0.685023  0.701331
375  1.440114  1.286856 -0.162297 -3.010342
441  1.354194 -0.873082  3.014799  1.161851
556 -0.159990 -1.500252  0.401730  3.163508
618 -3.044563  0.616846 -1.160417 -0.728614
823 -1.043805 -3.224799 -2.351218 -1.434053
845 -0.872288  3.336525  1.734538 -1.372031
877  0.453152  0.207799 -3.015585  0.991744

In [60]:
data[np.abs(data) > 3] = np.sign(data) * 3  # sign 根据数据正负生成 +-1
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024595    -0.029920     0.020590    -0.015524
std       0.962854     1.005323     1.017304     0.978655
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.673340    -0.716686    -0.654987    -0.718126
50%      -0.025894    -0.069529     0.027448    -0.047663
75%       0.664801     0.646900     0.720121     0.686966
max       2.989419     3.000000     3.000000     3.000000

#### 置换和随机抽样

In [61]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [62]:
sampler = np.random.permutation(5)
sampler

array([1, 2, 3, 4, 0])

In [63]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [64]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11

In [65]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)  # 允许重复选择
draws

0    5
0    5
3    6
2   -1
4    4
2   -1
3    6
4    4
1    7
0    5
dtype: int64

#### 计算指标/虚拟变量

In [66]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [67]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [68]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [69]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('data/movielens/movies.dat', sep='::', header=None, names=mnames, engine='python')
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [70]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
all_genres[:3]

['Animation', "Children's", 'Comedy']

In [71]:
genres = pd.unique(all_genres)  # 类别更多
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [72]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [73]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [74]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [75]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [76]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [77]:
# 对于更大的数据，上面这种使用多成员构建指标变量并不是特别快速，更好的方法是写一个 直接将数据写为Numpy数组 的底层函数

In [78]:
np.random.seed(12345)
values = np.random.randn(10)
values

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057,
        1.39340583,  0.09290788,  0.28174615,  0.76902257,  1.24643474])

In [79]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           0
1           0           0           1           0           0
2           0           0           0           0           0
3           0           0           0           0           0
4           0           0           0           0           0
5           0           0           0           0           0
6           1           0           0           0           0
7           0           1           0           0           0
8           0           0           0           1           0
9           0           0           0           0           0

### 字符串操作
#### 字符串对象方法

In [80]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [81]:
pieces = [x.strip() for x in val.split(',')]  # 去除空格和换行
pieces

['a', 'b', 'guido']

In [82]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [83]:
'::'.join(pieces)  # more Pythonic

'a::b::guido'

In [84]:
'guido' in val

True

In [85]:
val.index(',')

1

In [86]:
val.find(':')  # 没找到会返回-1，index会报异常

-1

In [87]:
val.count(',')

2

In [88]:
val.replace(',','::')

'a::b::  guido'

In [89]:
val.replace(',', '')

'ab  guido'

#### 正则表达式

In [90]:
# 模式匹配、替代、拆分
import re
text = "foo    bar\t baz  \tqux"  # \s 制表符、空格、换行符
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [91]:
regex = re.compile('\s+')  # 编译，形成可复用的正则表达式对象，节约CPU周期
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [92]:
regex.findall(text)

['    ', '\t ', '  \t']

In [93]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex 不区分大小写
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [94]:
m = regex.search(text)
m  # 获得匹配字符串的起始和结束位置

In [95]:
text[m.start():m.end()]

'dave@google.com'

In [96]:
print(regex.match(text))  # match 只在模式出现在字符串起始位置时匹配，没匹配到，返回 None

None

In [97]:
print(regex.sub('REDACTED', text))  # 返回新的字符串，用目标字符串替换原匹配字符串

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [98]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'  # 获取模式组件的元组
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [99]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [100]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

#### 向量化字符串函数

In [101]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [102]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [103]:
# 使用map能在字符串上应用函数，但是遇到NA会失败，使用str属性能避免这个问题
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [104]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [105]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [106]:
data.iloc[:3].map(re.compile(pattern, flags=re.IGNORECASE).findall)
# data.iloc[3:].map(re.compile(pattern, flags=re.IGNORECASE).findall)  # expected string or bytes-like object

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
dtype: object

In [107]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [108]:
# data.str.get(1)

In [109]:
data.str[:5]  # 字符串切片

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object